# 1+6*1 -> 2 ~ 7 =====몫이 0인 집단
# 7+6*2 -> 8 ~ 19 ===== 몫이 1 ~ 2인 집단
# 19+6*3 -> 20 ~ 37 ====== 몫이 3 ~ 5인 집단
# 몫이 6 ~ 9인 집단
# ...

# 0 -> 2
# 1,2 -> 3
# 3,4,5 -> 4
# 6,7,8,9 -> 5
# 10,11,12,13,14 -> 6


N = int(input())
answer = 2

if N==1:
    print(1)
else:
    # 구해야 할 숫자의 몫
    num = (N-2)//6
    
    # 현재 몫
    tmp = 0
    # 추가될 숫자
    x = 2
    
    # 만약 현재 몫보다 구해야할 숫자의 몫이 작으면 멈춘다.
    while(tmp < num):
        tmp += x
        x += 1
        
        answer += 1
    
        
    print(answer)